{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Irrigania is a web-based game on the shared use of limited water resources. The idea behind the game is that there are different villages with a number of farmers in each of them. The goal for each farmer is to generate the largest net in-come. However, this requires a certain amount of cooperation within the village. Each player represents one farmer in one village and has 10 fields for which he/she can decide how to use them each year. There are three options: rainfed agriculture, irrigation using river water, and irrigation using groundwater. Different costs and revenues are associated with the different types of fields. While largely simplified, these costs and revenues reflect some aspects of reality. Rainfed agriculture has the lowest costs, but also less revenue than the other options. With irrigation, more can be produced both in terms of quantity and quality, which is reflected by higher revenues, but also by higher costs. In the case of river water irrigation, the cost is fixed, but the income can be reduced if the river water has to be distributed among too many fields in a village. In the case of groundwater-based irrigation, the revenue is fixed, but the costs increase if the depth to groundwater increases.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Since overuse of resources could lower the payoff drastically, and the groundwater level might take several years to recover, some cooperation within the village and willingness to not overuse the resources is necessary to be able to win the game. However, in order to win, a farmer needs to do better than the other farmers within the village. Therefore, a farmer needs to find the subtle balance between supporting the village in not overusing the resources, while at the same time trying to generate more income than the other farmers within his/her village.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontMatter":{"slug":"irrigania","title":"Irrigania","href":"/games/irrigania","imgSrc":"/images/irrigania_hero.png","tags":["GEO","Simulation","Water Management"],"subtitle":"A web-based game about sharing water resources","objectives":["Teaching about collaboration and conflicts with regard to shared water resources","Illustration of a tragedy-of-the-commons situation related to water management","Understanding the difference between stream water resources and groundwater resources in their response to overuse and their potential recovery"],"scenarios":["University education and training"],"language":["en"],"usedIn":[{"name":"ESS371 – Wasser und Mensch"}],"keywords":["shared water resources","tragedy-of-the-commons","web-based"],"imprint":"Department of Geography, University of Zurich","contact":"Prof. Dr. Jan Seibert (jan.seibert@geo.uzh.ch), Marc Vis (marc.vis@geo.uzh.ch), Hydrology and Climate, Department of Geography","gallery":[{"imgSrc":"/images/irrigania1.png","alt":"Irrigania 1"},{"imgSrc":"/images/irrigania2.png","alt":"Irrigania 2"}],"resources":[{"name":"Research Paper: Seibert, J. and Vis, M. (2012)","href":"https://hess.copernicus.org/articles/16/2523/2012/"},{"name":"Website","href":"https://www.irrigania.ch"}]}},"__N_SSG":true}